Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, None, None,  0                                            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, None, None, 3 7232        input_2[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, None, None, 3 0           conv2d_5[0][0]                   
                                                                 conv2d_6[0][0]                   
                                                                 conv2d_7[0][0]                   
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, None, None, 3 0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, None, None, 3 9248        dropout_4[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, None, None, 3 0           leaky_re_lu_1[1][0]              
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, None, None, 3 9248        dropout_5[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, None, None, 3 0           leaky_re_lu_1[2][0]              
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, None, None, 3 9248        dropout_6[0][0]                  
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, None, None, 3 0           leaky_re_lu_1[3][0]              
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, None, None, 1 33          dropout_7[0][0]                  
==================================================================================================
Total params: 35,009
Trainable params: 35,009
Non-trainable params: 0
__________________________________________________________________________________________________
None
